import 'package:flutter/material.dart';

final SomeoneBackgroundcolorList = [
  Colors.green,
  Colors.pink,
  Colors.purple,
  Colors.deepOrange,
  Colors.deepPurple,
  Colors.grey[700],
  Colors.red,
  Colors.blue,
  Colors.teal,
  Colors.brown,
  Colors.indigo,
  Colors.black
];
final SomeoneBackgroundcolor = Colors.indigo[800];
final SomeoneAnswerBoxColor = Colors.white;
final secure_key = {
  '0': 'Q',
  '1': 'i',
  '2': 'n',
  '3': 'Z',
  '4': 'a',
  '5': 'w',
  '6': 'b',
  '7': 'p',
  '8': 'm',
  '9': 'f'
};

final SomeoneSubInfo =
    '당신을 선택한 사람이 누구인지 확인할 수 있게됩니다.\n특정 사용자를 차단할 수 있게 됩니다.\n질문 선택 가능 횟수가 50회로 증가합니다.\n질문 선택 대기시간이 2분 줄어듭니다.';

final WhatIsSomeone = r'''
SOMEONE

Q. 나를 선택한 질문을 어디서 확인할 수 있나요?
A. 첫 화면(선택 페이지)에서 좌측 하단에 종 아이콘 버튼을 누르면 확인할 수 있습니다.

Q. 비즈니스 연락처는 차단하고 싶어요.
A. 선택 페이지 우측 상단에 아이콘을 누르면 선택 연락처 리스트를 관리할 수 있습니다.

Q. 누군가의 선택은 무시하고 싶어요. (유료)
A. 받은 질문을 누르고 있으면 삭제 또는 차단할 수 있으며, 받은 질문 페이지에서 우측 상단(유료시 활성화)에서 관리할 수 있습니다.
''';

final SomeoneAppServiceTermsOfUse = r'''
서비스 이용약관

제1조 (목적)

본 약관은 회사(이하 "회사"라 함)가 제공하는 앱 서비스(이하 "서비스"라 함)를 이용함에 있어 회사와 이용자의 권리, 의무, 책임사항 및 기타 필요한 사항을 규정함을 목적으로 합니다.

제2조 (약관의 효력과 변경)

본 약관은 회사가 운영하는 앱에서 공지하거나 이메일 등을 통해 고지함으로써 효력이 발생합니다.
회사는 필요에 따라 본 약관을 변경할 수 있으며, 변경된 약관은 제1항과 같은 방법으로 공지함으로써 효력이 발생합니다.
회원은 변경된 약관에 대해 동의하지 않을 경우, 이용계약을 해지할 수 있습니다.

제3조 (서비스의 이용)

회사는 만 14세 이상 회원에게 서비스를 제공합니다.
회원은 서비스를 이용함에 있어 회사가 제공하는 서비스 이용 방법에 따라 이용할 수 있습니다.
회원은 회사의 서비스를 이용함에 있어서 관련 법령 및 본 약관, 회사가 공지하는 주의사항 및 서비스 이용안내 등을 준수하여야 합니다.

제4조 (서비스의 변경 및 중단)

회사는 서비스의 변경 및 중단을 위하여 회원에게 사전 공지 후 변경 및 중단할 수 있습니다.
회사는 불가항력적인 사유로 인해 서비스를 제공할 수 없는 경우, 서비스의 제공을 일시 중지할 수 있습니다.

제5조 (회원의 가입 및 탈퇴)

회원가입은 본 약관에 동의하고, 회원가입 양식에 제시된 개인정보를 제공한 후 이메일 인증을 완료하여 회사의 승인을 받아야 합니다.
회원은 언제든지 탈퇴할 수 있으며, 회사에 대한 미납금이 있을 경우에는 탈퇴 전에 모든 미납금을 납부하여야 합니다.

제6조 (회원의 개인정보 보호)

회사는 회원의 개인정보를 보호하기 위해 최선을 다하며, 회원의 개인정보를 수집, 이용, 제공하는 경우에는 회원의 동의를 받아야 합니다.
회사는 회원의 개인정보를 보호하기 위해 관련 법령에 따라 개인정보 처리방침을 제정하고 이를 공개해야 합니다.

제7조 (저작권 등 지적재산권의 귀속)

회사가 작성한 서비스 내 모든 콘텐츠의 저작권 및 지적재산권은 회사에 귀속합니다.

제8조 (책임의 제한)

회사는 회원이 서비스를 이용함으로써 발생하는 어떠한 손해에 대해서도 책임을 지지 않습니다.
회사는 회원이 서비스 내에서 제공하는 정보의 신뢰도, 정확성, 완전성 등에 대한 책임을 지지 않습니다.

제9조 (분쟁해결)

본 약관에 정하지 않은 사항이 있거나, 본 약관에 관련하여 분쟁이 발생할 경우, 회사와 회원은 성실히 협의하여 해결하기로 합니다.
본 약관에 관련된 분쟁으로 소송이 제기될 경우, 제소 당시 회원의 주소지를 기준으로 관할 법원을 정합니다.

제10조 (기타)

본 약관에 명시되지 않은 사항은 관련 법령 및 회사가 정한 이용안내 및 서비스 이용안내에 따릅니다.
회사는 필요하다고 판단되는 경우 회원에게 이메일, 문자, 전화 등의 방법으로 공지할 수 있습니다.

제11조 (구독 서비스)

회사는 구독 서비스를 제공할 수 있습니다. 구독 서비스는 회원이 정기적으로 일정한 금액을 지불하고, 일정 기간 동안 회사가 제공하는 특정 서비스를 이용할 수 있는 것을 말합니다.
회원이 구독 서비스를 이용하기 위해서는 회원 본인의 결제 정보를 등록해야 합니다.
구독 서비스 이용 기간이 만료되면 자동으로 연장됩니다. 회원은 구독 서비스를 해지하기 전에 회사에 이를 알리고 구독 서비스 이용 중인 기간까지 정산을 받아야 합니다.
구독 서비스 이용 중 회원이 회사의 이용약관을 위반하거나, 과도한 불이익을 주거나, 공공질서 및 미풍양속을 저해할 우려가 있는 경우 회사는 해당 회원의 구독 서비스 이용을 일시 정지 또는 해지할 수 있습니다.


2023년 3월 7일 이후로 본 약관은 유효합니다.
''';

final SomeoneInfoUse = r'''
개인정보 처리방침

제1조 개인정보 처리의 목적

이 개인정보 처리 방침은 Someone이 제공하는 서비스를 이용하는 개인 정보 주체의 개인정보 보호를 위하여 수집, 이용, 저장, 제공하는 방침을 제시합니다.

제2조 개인정보 처리의 범위

Someone은 다음과 같은 개인정보를 수집, 이용합니다.
이용자의 전화번호

제3조 개인정보의 처리 목적

Someone은 수집한 개인정보를 다음의 목적을 위해 사용합니다.
컨텐츠 제공

제4조 개인정보의 보유 및 이용기간

Someone은 수집한 개인정보를 이용자가 서비스를 이용하는 동안에만 보유하며, 서비스 이용이 종료되거나 개인정보의 수집 및 이용목적이 달성된 경우 해당 정보를 즉시 파기합니다.

제5조 개인정보 제공 및 공유

Someone은 이용자의 개인정보를 제3자에게 제공하거나 공유하지 않습니다. 단, 다음의 경우에는 예외적으로 개인정보를 제공할 수 있습니다.
이용자들이 사전에 동의한 경우
법적 의무의 이행을 위하여 필요한 경우

제6조 이용자의 권리와 의무

이용자는 Someone에 대하여 개인정보 보호법 등 관련 법령에 따라 다음과 같은 권리를 행사할 수 있습니다.
개인정보 열람 요구
개인정보의 정정 및 삭제 요구
개인정보 처리정지 요구

제7조 개인정보 처리방침의 변경

Someone은 필요한 경우 개인정보 처리방침을 변경할 수 있으며, 변경된 내용은 <https://best-friend-7a1.notion.site/6b3666149ef244ff9c9575cf42610b71>으로 공지합니다.

제8조 개인정보 관련 문의 및 불만사항 처리 방법

Someone은 이용자의 개인정보 보호를 위해 최선을 다하고 있습니다. 만약 개인정보 처리에 대한 문의나 불만사항이 있을 경우, 아래의 연락처로 문의해주시기 바랍니다.
이메일: someoneappdev@gmail.com

본 개인정보 처리방침은 2023년 3월 7일부터 적용됩니다.
''';
